Revit 2027 API
RebarShapeConstraintCircumference Constructor
 Create a circumference constraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeConstraintCircumference(
	ElementId paramId,
	RebarShapeArcReferenceType refType
)
Public Sub New (
	paramId As ElementId,
	refType As RebarShapeArcReferenceType
)
public:
RebarShapeConstraintCircumference(
	ElementId^ paramId,
	RebarShapeArcReferenceType refType
)
new :
        paramId : ElementId *
        refType : RebarShapeArcReferenceType -> RebarShapeConstraintCircumference
Parameters
paramId ElementId
 The Id of a Rebar Shape parameter.
refType RebarShapeArcReferenceType
 A choice of rule for measuring the circumference.
Exceptions
Exception | Condition
ArgumentException |  paramId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarShapeConstraintCircumference Class
Autodesk.Revit.DB.Structure Namespace